spec/fixtures/PU_AP_ALMA_INVOICE_DEATILS_example.xml

<?xml version='1.0'?>
<query numrows="3" queryname="PU_AP_ALMA_INVOICE_DETAILS" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="">
<row rownumber="1">
<INVOICE_ID><![CDATA[9999999999999999]]></INVOICE_ID>
<PYMNT_SELCT_STATUS><![CDATA[Paid]]></PYMNT_SELCT_STATUS>
<INVOICE_DATE><![CDATA[20210210]]></INVOICE_DATE>
<PAYMENT_VOUCHER_DATE><![CDATA[20210611]]></PAYMENT_VOUCHER_DATE>
<VOUCHER_ID><![CDATA[A9999999]]></VOUCHER_ID>
<PYMNT_AMT>805.14</PYMNT_AMT>
<CURRENCY_PYMNT><![CDATA[USD]]></CURRENCY_PYMNT>
<PYMNT_MESSAGE/>
</row>
<row rownumber="2">
<INVOICE_ID><![CDATA[9999889999999999]]></INVOICE_ID>
<PYMNT_SELCT_STATUS><![CDATA[Paid]]></PYMNT_SELCT_STATUS>
<INVOICE_DATE><![CDATA[20210329]]></INVOICE_DATE>
<PAYMENT_VOUCHER_DATE><![CDATA[20210602]]></PAYMENT_VOUCHER_DATE>
<VOUCHER_ID><![CDATA[A9999988]]></VOUCHER_ID>
<PYMNT_AMT>500</PYMNT_AMT>
<CURRENCY_PYMNT><![CDATA[USD]]></CURRENCY_PYMNT>
<PYMNT_MESSAGE/>
</row>
<row rownumber="3">
<INVOICE_ID><![CDATA[999779999999999]]></INVOICE_ID>
<PYMNT_SELCT_STATUS><![CDATA[Paid]]></PYMNT_SELCT_STATUS>
<INVOICE_DATE><![CDATA[20210430]]></INVOICE_DATE>
<PAYMENT_VOUCHER_DATE><![CDATA[20210602]]></PAYMENT_VOUCHER_DATE>
<VOUCHER_ID><![CDATA[A9999977]]></VOUCHER_ID>
<PYMNT_AMT>70.6</PYMNT_AMT>
<CURRENCY_PYMNT><![CDATA[USD]]></CURRENCY_PYMNT>
<PYMNT_MESSAGE/>
</row>
</query>
